src/exps/fio_benchmarks/paperexps/R-2T.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=26900: Thu Sep 27 21:45:08 2018
  write: IOPS=1011, BW=4046KiB/s (4143kB/s)(712MiB/180102msec)
    clat (usec): min=82, max=302804, avg=984.73, stdev=9563.67
     lat (usec): min=82, max=302805, avg=985.18, stdev=9563.69
    clat percentiles (usec):
     |  1.00th=[    94],  5.00th=[   101], 10.00th=[   103], 20.00th=[   105],
     | 30.00th=[   106], 40.00th=[   108], 50.00th=[   109], 60.00th=[   111],
     | 70.00th=[   112], 80.00th=[   116], 90.00th=[   143], 95.00th=[   161],
     | 99.00th=[ 23200], 99.50th=[ 27919], 99.90th=[156238], 99.95th=[170918],
     | 99.99th=[242222]
   bw (  KiB/s): min=   13, max=10708, per=79.96%, avg=3234.33, stdev=4112.36, samples=359
   iops        : min=    3, max= 2677, avg=808.19, stdev=1028.12, samples=359
  lat (usec)   : 100=4.56%, 250=91.87%, 500=1.05%, 750=0.93%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.05%, 20=0.03%, 50=1.02%
  lat (msec)   : 100=0.10%, 250=0.38%, 500=0.01%
  cpu          : usr=0.51%, sys=1.42%, ctx=182158, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,182152,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=27189: Thu Sep 27 21:45:08 2018
  write: IOPS=6, BW=25.8KiB/s (26.4kB/s)(7744KiB/300150msec)
    clat (usec): min=105, max=315551, avg=155020.76, stdev=66245.80
     lat (usec): min=105, max=315552, avg=155021.57, stdev=66245.87
    clat percentiles (usec):
     |  1.00th=[   112],  5.00th=[   118], 10.00th=[ 32637], 20.00th=[112722],
     | 30.00th=[137364], 40.00th=[156238], 50.00th=[166724], 60.00th=[175113],
     | 70.00th=[189793], 80.00th=[204473], 90.00th=[223347], 95.00th=[252707],
     | 99.00th=[278922], 99.50th=[291505], 99.90th=[316670], 99.95th=[316670],
     | 99.99th=[316670]
   bw (  KiB/s): min=   16, max=  232, per=100.00%, avg=25.79, stdev=19.99, samples=600
   iops        : min=    4, max=   58, avg= 6.44, stdev= 5.00, samples=600
  lat (usec)   : 250=8.16%, 500=0.77%
  lat (msec)   : 2=0.21%, 4=0.26%, 10=0.52%, 50=0.26%, 100=1.50%
  lat (msec)   : 250=83.21%, 500=5.11%
  cpu          : usr=0.01%, sys=0.03%, ctx=1938, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1936,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4046KiB/s (4143kB/s), 4046KiB/s-4046KiB/s (4143kB/s-4143kB/s), io=712MiB (746MB), run=180102-180102msec

Run status group 1 (all jobs):
  WRITE: bw=25.8KiB/s (26.4kB/s), 25.8KiB/s-25.8KiB/s (26.4kB/s-26.4kB/s), io=7744KiB (7930kB), run=300150-300150msec

Disk stats (read/write):
  sdc: ios=118/184087, merge=0/0, ticks=1479/476680, in_queue=478114, util=99.28%