src/exps/fio_benchmarks/paperexps/R-32G.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=26751: Thu Sep 27 15:37:37 2018
  write: IOPS=1075, BW=4303KiB/s (4406kB/s)(757MiB/180071msec)
    clat (usec): min=76, max=438987, avg=925.22, stdev=8394.42
     lat (usec): min=76, max=438988, avg=925.70, stdev=8394.45
    clat percentiles (usec):
     |  1.00th=[    93],  5.00th=[    98], 10.00th=[   103], 20.00th=[   105],
     | 30.00th=[   106], 40.00th=[   108], 50.00th=[   109], 60.00th=[   111],
     | 70.00th=[   112], 80.00th=[   116], 90.00th=[   145], 95.00th=[   161],
     | 99.00th=[ 23200], 99.50th=[ 62129], 99.90th=[116917], 99.95th=[147850],
     | 99.99th=[175113]
   bw (  KiB/s): min=   25, max= 8938, per=78.93%, avg=3396.28, stdev=3891.98, samples=359
   iops        : min=    6, max= 2234, avg=848.71, stdev=972.95, samples=359
  lat (usec)   : 100=6.43%, 250=90.01%, 500=0.98%, 750=0.86%, 1000=0.01%
  lat (msec)   : 2=0.04%, 4=0.01%, 10=0.12%, 20=0.04%, 50=0.97%
  lat (msec)   : 100=0.13%, 250=0.39%, 500=0.01%
  cpu          : usr=0.45%, sys=1.82%, ctx=193718, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,193715,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=27027: Thu Sep 27 15:37:37 2018
  write: IOPS=111, BW=444KiB/s (455kB/s)(130MiB/300033msec)
    clat (usec): min=80, max=442006, avg=8995.23, stdev=30061.75
     lat (usec): min=80, max=442007, avg=8995.72, stdev=30061.84
    clat percentiles (usec):
     |  1.00th=[   101],  5.00th=[   105], 10.00th=[   106], 20.00th=[   108],
     | 30.00th=[   110], 40.00th=[   111], 50.00th=[   113], 60.00th=[   115],
     | 70.00th=[   118], 80.00th=[   145], 90.00th=[  1418], 95.00th=[101188],
     | 99.00th=[132645], 99.50th=[156238], 99.90th=[177210], 99.95th=[183501],
     | 99.99th=[316670]
   bw (  KiB/s): min=    8, max= 1503, per=100.00%, avg=445.32, stdev=360.43, samples=600
   iops        : min=    2, max=  375, avg=111.28, stdev=90.06, samples=600
  lat (usec)   : 100=0.80%, 250=88.28%, 500=0.11%, 750=0.15%, 1000=0.15%
  lat (msec)   : 2=0.77%, 4=0.04%, 10=1.14%, 20=0.17%, 50=0.16%
  lat (msec)   : 100=2.10%, 250=6.10%, 500=0.01%
  cpu          : usr=0.06%, sys=0.23%, ctx=33340, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,33337,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4303KiB/s (4406kB/s), 4303KiB/s-4303KiB/s (4406kB/s-4406kB/s), io=757MiB (793MB), run=180071-180071msec

Run status group 1 (all jobs):
  WRITE: bw=444KiB/s (455kB/s), 444KiB/s-444KiB/s (455kB/s-455kB/s), io=130MiB (137MB), run=300033-300033msec

Disk stats (read/write):
  sdc: ios=80/227051, merge=0/0, ticks=1421/475338, in_queue=476691, util=99.00%