src/exps/fio_benchmarks/paperexps/R-4G.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=24385: Thu Sep 27 15:10:32 2018
  write: IOPS=1028, BW=4113KiB/s (4212kB/s)(723MiB/180061msec)
    clat (usec): min=83, max=865589, avg=849.26, stdev=9304.38
     lat (usec): min=84, max=865590, avg=849.73, stdev=9304.40
    clat percentiles (usec):
     |  1.00th=[    95],  5.00th=[   102], 10.00th=[   105], 20.00th=[   106],
     | 30.00th=[   109], 40.00th=[   110], 50.00th=[   111], 60.00th=[   113],
     | 70.00th=[   115], 80.00th=[   123], 90.00th=[   149], 95.00th=[   184],
     | 99.00th=[ 22938], 99.50th=[ 23462], 99.90th=[108528], 99.95th=[112722],
     | 99.99th=[278922]
   bw (  KiB/s): min=   19, max= 8924, per=90.92%, avg=3739.72, stdev=4000.40, samples=312
   iops        : min=    4, max= 2231, avg=934.59, stdev=1000.10, samples=312
  lat (usec)   : 100=3.77%, 250=92.70%, 500=1.12%, 750=0.83%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.09%, 20=0.06%, 50=0.99%
  lat (msec)   : 100=0.07%, 250=0.34%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=0.45%, sys=1.95%, ctx=185441, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,185168,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=24643: Thu Sep 27 15:10:32 2018
  write: IOPS=123, BW=495KiB/s (507kB/s)(145MiB/300249msec)
    clat (usec): min=75, max=873184, avg=8082.28, stdev=36997.64
     lat (usec): min=75, max=873184, avg=8082.77, stdev=36997.71
    clat percentiles (usec):
     |  1.00th=[    95],  5.00th=[   103], 10.00th=[   106], 20.00th=[   109],
     | 30.00th=[   111], 40.00th=[   112], 50.00th=[   114], 60.00th=[   117],
     | 70.00th=[   121], 80.00th=[   145], 90.00th=[   253], 95.00th=[101188],
     | 99.00th=[110625], 99.50th=[124257], 99.90th=[557843], 99.95th=[759170],
     | 99.99th=[868221]
   bw (  KiB/s): min=    8, max= 9064, per=100.00%, avg=513.01, stdev=1135.56, samples=579
   iops        : min=    2, max= 2266, avg=128.25, stdev=283.89, samples=579
  lat (usec)   : 100=2.77%, 250=87.18%, 500=1.01%, 750=0.25%, 1000=0.04%
  lat (msec)   : 2=0.16%, 4=0.22%, 10=0.88%, 20=0.64%, 50=0.33%
  lat (msec)   : 100=1.07%, 250=5.27%, 500=0.06%, 750=0.04%, 1000=0.07%
  cpu          : usr=0.06%, sys=0.25%, ctx=37132, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,37128,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4113KiB/s (4212kB/s), 4113KiB/s-4113KiB/s (4212kB/s-4212kB/s), io=723MiB (758MB), run=180061-180061msec

Run status group 1 (all jobs):
  WRITE: bw=495KiB/s (507kB/s), 495KiB/s-495KiB/s (507kB/s-507kB/s), io=145MiB (152MB), run=300249-300249msec

Disk stats (read/write):
  sdc: ios=57/226394, merge=0/499996, ticks=5869/6413945, in_queue=6329142, util=99.01%